[
	{
		"type": "panel",
		"span": "Руководство начинающего скорохода"
	},
	{
		"type": "paragraph",
		"items": [
			{
				"type": "span",
				"text": "Sire Alligator | 14.04.2016г."
			}
		]
	},
	{
		"type": "image",
		"src": "/images/beginners-guide.png"
	},
	{
		"type": "paragraph",
		"items": [
			{
				"type": "span",
				"text": "Некоторые подсказки для тех, кто хочет освоить ремесло скорохода."
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Шаг 1: Выберите игру, которая вам по душе",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Обязательно выбирайте игру, которая для вас что-то значит, но брать самую любимую для первых шагов в деле спидрана будет неразумно. Слишком много переигрывания одного и того же может заставить вас ненавидеть игру, пока вы ещё не привыкли к сути спидранинга."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Так что начинайте с игры, которая вам нравится и в которой вы довольно неплохи. Обратите также внимание на такие критерии, как популярность игры в спидран-сообществе, наличие рекордов и гайдов по быстрому её прохождению."
					}	
				]
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Шаг 2: Проведите подготовку",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Нельзя переоценить важность знания игровых нюансов. Вы должны назубок знать плюсы и минусы игровых персонажей, точный порядок выполнения глитчей и их теоретическую основу."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Найдите запись мирового рекорда по этой игре, прошерстите форумы на предмет постов о трюках, глитчах, маршрутах, статистике или каких-то других вещах, играющих важную роль в этой игре. Выделите какое-то время в течение недели специально посвящённое изучению этого. Скорее всего это будет самой неприятной частью, потому что вам понадобится делать заметки (в уме или на бумаге/компьютере), чтобы разобраться в подноготной игры и почему всё работает так как работает."
					}	
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Теперь вы готовы к боевым действиям."
					}	
				]
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Шаг 3: Разведка боем",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Просто пройдите игру, не обращая внимания на время, спокойно перезагружаясь в случае чего и расставьте отметки по времени. С чего-то всё равно нужно начинать."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Теперь открываете запись мирового рекорда и размечаете его как размечали свой забег. Не расстраивайтесь по поводу разницы в скорости. Это всё-таки мировой рекорд."
					}	
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Обратите внимание, какие действия этот забег пропускает из того, что вы делали в своём прохождении. Какие особенности игры, приёмы, трюки используются."
					}	
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Отмечайте всё в своих записях для последующего использования."
					}	
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Благодаря этому у вас появляется фундамент, на котором можно работать над полноценным спидраном."
					}	
				]
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Шаг 4: Начинаем изучение",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Распределите все трюки, глитчи, тактические приёмы, действия с меню и вообще всё, что важно для скоростного прохождения вашей игры в категории по сложности (легко, средне, трудно). В каком порядке их изучать зависит от вас. Я обычно стараюсь сначала вникнуть в сложные вещи, поскольку они часто включают в себя и более простые. Наша цель — выработать навыки, создать мышечные рефлексы для исполнения всех этих действий во всех категориях. Пока не забивайте себе голову полноценными забегами, ваша задача сфокусироваться на том, что как и почему именно так работает в игре. И пока вы в этом разберётесь, вы станете делать все эти вещи заметно быстрее, а общее исполнение с течением времени значительно улучшится. Практикуйте действия, пока они не начнут у вас получаться автоматически, без концентрации внимания. Для проверки этого, попробуйте поддерживать разговор с кем-нибудь, в то время, как вы выполняете действия пользуясь мышечной памятью."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Звучит сложно, но на самом деле выработать навык на каждый отдельный трюк занимает вовсе не так много времени, когда ты знаешь, что делать."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Конечно, есть особо сложные трюки, для которых этот критерий не подходит, поскольку на них нужно серьёзно концентрироваться, но подразумевается, что любой, кто разбирается в этой игре, знает это."
					}
				]
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Шаг 5: Ближе к делу",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Теперь разделите прохождение на фрагменты (по уровням или как вам будет удобно). Наша цель остаётся той же что и прежде: выработка навыков - за тем исключением, что теперь мы проходим целые участки игры, которые требуют последовательное исполнение разных действий. Мы знакомимся с визуальными и звуковыми подсказками в какой момент и где нужно исполнять приём. Грамотная подготовка трюка так же важна, как и сам навык исполнения."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Опять же, мы стремимся к тому, чтобы уметь делать всё это, отвлекаясь на разговор, так что наличие кого-нибудь, кто развлечёт вас разговором может помочь выработке автоматизма."
					}
				]
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Шаг 6: Поехали",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Вернитесь в самое начало, сделайте полноценное прохождение и поглумитесь над своим временем казуального прохождения. Разница теперь в том, что теперь вы обзавелись навыками автоматизма, чувством момента (то что мы отрабатывали в 5 пункте со звуковыми и визуальными подсказками) и общим знанием игры, которые вы получили за время обучения. Когда у вас получится достойный забег, которым вы довольны - сравните его с результатом мирового рекорда и отметьте, где вы отстаёте, а где держитесь вровень или лучше. Основываясь на этих данных попрактикуйте слабые места, укрепите сильные и делайте очередной забег. Перейдя к этому этапу, НЕ ТРАТЬТЕ чересчур много времени на практику какого-то одного отдельного отрезка. Делая так вы рискуете утратить автоматизм в других местах игры."
					}
				]
			}
		]
	},
		{
		"type": "spoiler",
		"header": "Шаг 7: Ловушка рестарта и почему её нужно избегать",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"С набором опыта вы можете участвовать в гонках с другими раннерами, работать в направлении мирового рекорда и т.д... Есть одна вещь, которой вы должны постоянно избегать. Я называю её «ловушка рестарта». Это ситуация, когда игрок начинает регулярно сбрасывать таймер и начинать забег заново, допустив даже малейшую ошибку на первых отрезках игры, и предполагая, что из-за неё дальше стараться нет смысла."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Это неверное предположение. Довольно много знаменитых спидранеров в своём мировом рекорде имеют несколько довольно плохих отрезков (по их стандартам). Когда вы начинаете руководствоваться логикой «идеально или никак» и начинаете постоянно ресетить, вы ОЧЕНЬ быстро «перегорите» и расхотите проходить даже самую любимую игру. Единственный вариант, когда допустимо жать рестарт, это если полученное вами отставание гарантированно невозможно отыграть на последующих отрезках. Например, ориентируясь по лучшим сплитам, на протяжении оставшегося прохождения я могу отыграть 14 секунд, а к этому отрезку я отстал на 6. При таких ошибках я продолжу проходить. Если отстану больше, чем на 14 — буду смотреть, хочу ли я попрактиковать ближайший фрагмент игры, или хочу начать заново и получить хорошее время."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Всегда стоит помнить, что при частых ресетах вы тренируете только первые отрезки игры, игнорируя при этом не менее важные, но находящиеся дальше по ходу прохождения, части игры. В итоге, наконец получив после множества перезапусков достойный старт, вы запросто можете растерять это преимущество на предстоящих этапах."
					}
				]
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Шаг 8: Помощь сообщества",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Никогда не расстраивайтесь из-за того, что кто-то прошёл игру быстрее вас. Если кто-то превзойдёт ваше время, поинтересуйтесь у них, что они делали по-другому, просмотрите видео их прохождения и изучите различия самостоятельно. Пробуйте их методы и никогда не относитесь к этому факту в духе «Я проиграл. Мне никогда не побить такое время». Спидран-сцена известна как одно из самых взаимно уважительных и готовых прийти друг другу на помощь сообществ, которые мне доводилось видеть. Не следует бояться обратиться за помощью, советами или чем-угодно, связанным со спидранами. Как правило люди сочтут за честь помочь вам."
					}
				]
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Шаг 9: Стратегии TAS",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Когда вы вплотную приблизитесь или окажетесь наравне c результатом мирового рекорда и будете вполне уверены в своих способностях, обратите внимание на прохождение игры TAS и внимательно изучите, что в нём выполняют. Разберитесь, есть ли какая-либо возможность внедрить эти техники в ваш забег, чтобы улучшить время прохождения. Идеал спидранера — максимально возможно приблизиться к тому, что можно сделать в игре, осуществляя покадровый ввод нажатий. Зачастую исполнение хотя бы одной из TAS-стратратегий может сэкономить кучу времени по сравнению с не такими тренированными людьми. И более того, подобная практика ментально настраивает вас на сохранение уже не секунд, а отдельных кадров, что подымает ваши стандарты оценки забегов. Со временем подобная практика повысит вашу уверенность и комфорт в обращении с игрой, а с ними и ваш навык до действительно впечатляющих высот."
					}
				]
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Шаг 10: Я всегда с собой беру видеокамеру",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Всегда записывайте каждую попытку спидрана. Если вам повезёт вытянуть счастливый жребий и поставить рекорд, вы пожалеете, что это не было записано. Если вам нужно попрактиковать какой-то отдельный участок, полезно иметь запись этого для детального анализа. Если случится что-то невероятное или просто прикольное, вы сами будете рады записи, а уж тем более те, кому вы решите это показать."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"«Чувак, у которого был бы мировой рекорд, если бы он позаботился записать обыкновенный тренировочный забег» ©"
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Каким бы скромным и застенчивым вы не были, это не такая вещь, которая может помешать вам просто включить запись видео из игры и таймера. Если вы не являетесь стримером, нет особой нужды записывать какие-либо комментарии, хотя иногда это может добавить изюминку вашему забегу."
					}
				]
			}
		]
	},
	{
		"type": "spoiler",
		"header": "Финальные штрихи",
		"items": [
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Не теряйте концентрацию, даже когда вы взбудоражены."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Проще сказать, чем сделать, но стрессоустойчивость — необходимое свойство спидранера. Если вы штурмуете мировой рекорд перед толпой народа (и притом с ограниченным количеством попыток) оставаться спокойным фактически невозможно. Но в такой ситуации вам нужно будет использовать нахлынувший адреналин для предельной точности действий и реакции. А в обычном забеге без особого давления, когда за вами никто не следит действуйте включив режим «мне вообще-то пофиг». Предвкушая хороший результат, можно оплошать даже в самом простом действии из-за нервов. Будьте спокойны, оставайтесь сконцентрированным."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Регулярно устраивайте перерывы."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Это мега-важно. Очень сложно отложить контроллер, когда вы только что были безумно близки к тому, чтобы перехватить звание быстрейшего в мире, но без надлежащего отдыха вы только истощите себя. Любая боль (в руках, спине, шее) означает, что вы чрезмерно напряжены, так что если вы начали испытывать что-то подобное — устройте суточный перерыв. Серьёзно. Не переживайте, игра будет по-прежнему на месте, когда вы вернётесь. Даже один час качественного спидраннинга это лошадиная доза «ультраконцентрации». А поддержание себя в таком состоянии на протяжении многих часов сделает вас истощённым, раздражённым... и никудышным в спидране."
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Наслаждайтесь!"
					}
				]
			},
			{
				"type": "paragraph",
				"items": [
					{
						"type": "span",
						"text":	"Может быть сложно насладиться игрой, когда вы переигрываете один и тот же уровень и слышите ту же музыку в 5000-ный раз. Чтобы находить мотивацию в игре, которую вы знаете от А до Я, придумайте сами себе промежуточные цели, радуйтесь достижениям, включайте любимую мелодию, хвастайтесь друзьям."
					}
				]
			}
		]
	},
	{
		"type": "paragraph",
		"items": [
			{
				"type": "span",
				"text": "P.S.: Данное руководство основано на личном опыте и не может считаться абсолютно универсальным."
			}
		]
	}
]