{
	"header": "Словарь скорохода",
	"sections": [
		{
			"name": "Общие понятия",
			"words": [
				{
					"name": "run — «ран», забег, прохождение",
					"description": "Однократное прохождение игры с замером времени, а также запись такого прохождения."
				},
				{
					"name": "speedrun — «cпидран», скоростной забег",
					"description": "Прохождение игры целиком или части (например, уровня) с целью завершить как можно быстрее."
				},
				{
					"name": "speedruner — «спидранер», игрок, ранер, скороход",
					"description": "Человек, проходящий игру на скорость."
				},
				{
					"name": "hype — «хайп», предвкушение, воодушевление",
					"description": "В русском спидран-сообществе прижилось как «ажиотаж». Ожидание эпичного события, радость по его поводу. *типичное словечко для самоопределения спидран-сообщества."
				},
				{
					"name": "rage pause — пауза ярости",
					"description": "Пауза, нажатая под сильными негативными эмоциями, злостью, от неудачи на данном отрезке игры. Чаще всего сопровождается матом, что запрещено на многих спидранерских мероприятиях. В казуальном варианте часто встречается «ragequit» — выход из игры с громкими криками и ломанием аппаратуры."
				},
				{
					"name": "softlock — подвесить игру",
					"description": "Отличается от аппаратной ошибки тем, что игра функционирует нормально, но персонаж или необходимый предмет оказывается в такой позиции, что дальнейшее прохождение невозможно. Игру становится невозможно завершить, спидран на этом заканчивается."
				},
				{
					"name": "trick setup — подготовка к выполнению трюка",
					"description": "Последовательность действий, которые нужно произвести, чтобы успешно провернуть (pull off) особо сложный (pixel / frame perfect) трюк, который человеку почти невозможно исполнить с ходу."
				},
				{
					"name": "estimate [time] — оценочное, предварительное время",
					"description": "Время, в которое должен уложиться скороход, чтобы оставаться в рамках графика марафона. Обычно на 10-20% больше личного рекорда (PB) у этого игрока."
				},
				{
					"name": "solid run — достойный, приемлемый забег",
					"description": "(как противоположность - ruined run)"
				},
				{
					"name": "NPC — неигровой персонаж",
					"description": "*это слово мы написали, чтобы решить, как его обзывать: моб, непись, монстр или как-нибудь ещё"
				},
				{
					"name": "trigger — триггер",
					"description": "(отсюда и глагол «триггерить») Активация чего-либо, а также место, проходя через которое ты активируешь действие, запрограммированое игрой, будь то игровая заставка, спавн (spawn - появление) чего-нибудь или смерть."
				},
				{
					"name": "cutscene — кат-сцена",
					"description": "Игровой ролик, игровая заставка."
				},
				{
					"name": "title screen — титульный экран",
					"description": "Главное меню игры."
				},
				{
					"name": "game Time — игровое время",
					"description": "Внутриигровой таймер. В некоторых играх не подсчитывается время проведенное в режиме паузы или, допустим, в окне загрузки; поэтому не является точным представлением реального времени, затраченного на прохождение."
				},
				{
					"name": "buffering — буферизация",
					"description": "Игра позволяет вам выставлять определённую последовательность действий, за счет того, что персонаж не может выполнять некоторые действия одновременно. То есть, если вы нажмёте клавишу какого-то действия пока происходит другое, то нажатие отправится в буфер памяти, и будет выполнено когда закончится первое. Пример: в игре Commander Keen IV если выстрелить и зажать прыжок, то как только анимация выстрела пройдет, персонаж прыгнет."
				},
				{
					"name": "damage boost — ускорение уроном",
					"description": "Специально получить урон от противника или препятствия. В зависимости от механики игры позволяет ускориться или подпрыгнуть выше обычного за счёт отталкивания; или же проскочить через врагов или препятствия во время кадров неуязвимости."
				},
				{
					"name": "death warp — «смертепорт»",
					"description": "Специально умереть, чтобы сохранить время, появившись в точке респауна. Как правило, используется для того, чтобы избежать долгого пути назад через уже пройденные локации."
				},
				{
					"name": "frame — кадр",
					"description": "Кадр игры. Их количество в секунде составляют ваш fps (кадр в секунду). Интервал времени, с частотою в который происходит смена кадра и отклик игры (программы) на нажатие клавиш. Как правило, 1/60 или 1/30 секунды, в зависимости от игры, но бывают исключения."
				},
				{
					"name": "frame advance — покадровое продвижение",
					"description": "На настоящий момент основная техника для создания TAS'ов. Позволяет задавать нажатие кнопки точно в требуемый кадр, чем и достигается идеальная точность исполнения."
				},
				{
					"name": "frame perfect — «точно в кадр»",
					"description": "Действие, которое нужно совершить обязательно в определенный кадр, то есть идеально по времени."
				},
				{
					"name": "pixel perfect — «в точку»",
					"description": "Трюк, состоящий в выполнении действия в определенном пикселе."
				},
				{
					"name": "invincibility frame — кадры неуязвимости",
					"description": "В некоторых играх (в основном, в платформерах) при получении урона персонаж становится на короткое время неуязвимым."
				},
				{
					"name": "glitch — «глич», глюк, баг",
					"description": "Непреднамеренная ошибка в игровом коде. Некоторые используются, некоторые бесполезны."
				},
				{
					"name": "input lag — задержка сигнала/действия",
					"description": "Задержка между нажатием на клавишу / кнопку и видимым на экране результатом. Часто является проблемой оборудования, очень редко является результатом плохого написания игрового кода."
				},
				{
					"name": "lag — «лаг», тормоза",
					"description": "Часто случается на приставках, и на слабых компах из-за чрезмерного количества противников, или из-за угла камеры, или даже просто из-за того, что вы находитесь в определённых местах."
				},
				{
					"name": "lag reduction — борьба с задержкой / «лагом»",
					"description": "Различные способы устранения тормозов для сохранения драгоценного времени, например, убийство опредлённых врагов, смена угла камеры, предотвращение появления некоторых объектов / противников."
				},
				{
					"name": "luck-based — основанный на удаче",
					"description": "Действия успех которых напрямую зависит от RNG / рандома, и из-за чего они непостоянны. Некоторые крайне чувствительные к исполнению трюки (к примеру, требующие несколько точных до доли секунды нажатий в определённом пикселе экрана) можно назвать «зависящими от удачи» из-за низкого шанса всё сделать правильно, хотя удача в этих случаях не при чем."
				},
				{
					"name": "luck manipulation — повелитель Фортуны",
					"description": "Техника машины ТАС, позволяющая увеличить процент удачи. Манипуляция удачей при помощи простого выжидания момента или допустим атаки в определенные кадры. К сожалению, редко удается такое провернуть в реальном забеге."
				},
				{
					"name": "NTSC",
					"description": "Американская версия игры."
				},
				{
					"name": "NTSC-J",
					"description": "Японская версия игры, иногда имеет баги, не предоставленные в американской версии."
				},
				{
					"name": "manipulation — манипуляция",
					"description": "То, что делает игрок, чтобы изменить результат игровых событий. Некоторые действия в игре могут влиять на шанс выпадения предметов, появление того или иного объекта в неположенных местах, изменение поведения противников."
				},
				{
					"name": "[button] mash — «мэшить»",
					"description": "Усиленно и быстро нажимать клавиши в определенном или неопределенном порядке."
				},
				{
					"name": "OoB / out of bounds — «вне карты», выход за пределы карты",
					"description": "Выход за обычные границы игры. В некоторых играх сложно определить, что подпадает под это определение."
				},
				{
					"name": "overflow & underflow — обнуление / переполнение",
					"description": "Глич / баг, основанный на манипуляцях с памятью. Например, если при определенных манипуляциях в Castlevania: Symphony of the Night вы продадите кристалл, как бы не имея его, то из 0 вычтется 1 и получится 255. Близкое понятие «to dupe» - обманывать, надувать. В играх: «дюпать» - такой багоюз, при котором игрок создает большое количество чего-либо на пустом месте."
				},
				{
					"name": "PAL",
					"description": "Европейская версия игры, более новая: на более старых консолях могут идти в скорости 5/6 от американской версии:, часто не рекомендуется для марафонов"
				},
				{
					"name": "pause buffer — буферизация паузой",
					"description": "То же, что и буферизация, но с использованием паузы. Возможна не во всех играх. Заставляем игру воспринимать внутриигровые события, как то нужно спидранеру, при помощи паузы."
				},
				{
					"name": "PR / personal record — личный рекорд",
					"description": "Просто ПБ."
				},
				{
					"name": "RNG / random nmber generator — генератор случайных чисел",
					"description": "Функция, отвечающая за случайные события в игре."
				},
				{
					"name": "RTA / real time attack",
					"description": "Прохождение в режиме реального времени. Время затраченное на прохождение от и до в реальном временном эквиваленте, учитывая все загрузки, ролики и т.д. Во время марафонов является главным и единственным измерением времени, необходимого на прохождение."
				},
				{
					"name": "save state — «сэйвстэйт»",
					"description": "Сохранение в любом месте. Функция эмуляторов, позволяющая сохранить состояние игры в вирутальной консоли."
				},
				{
					"name": "save warp — «сэйфварп»",
					"description": "Сохранения и перезагрузка (необязательно) с целью сохранения времени. Обычно используется, чтобы не проходить по уже пройденным локациям. В какиз-то играх с помощью этого приема можно проходить сквозь стены."
				},
				{
					"name": "sequence break — нарушение последовательности",
					"description": "Нарушение естественного порядка прохождения игры."
				},
				{
					"name": "segmented run — сегментированный забег",
					"description": "Деление игры на различные отрезки, каждый из которых проходится по много раз для получения идеального времени. Лучшие отрезки собираются в цельный забег чтобы минимизировать суммарное время прохождения. Не используется на марафонах. Запись такого спидрана может занимать годы и по сути своей близка к TAS, только с тем отличием, что играют тут все же люди."
				},
				{
					"name": "spawn — «респ», «респавн»",
					"description": "Время и локация, где появится объект, NPC, враг. Респы могут быть случайными, запрограммированными и сманипулированными."
				},
				{
					"name": "sub-pixel — саб-пиксель",
					"description": "Игра отслеживает положение персонажа / предмета в игре точнее, чем может отобразить на экране. Иногда эта более тонкая, чем можно увидеть, разница в положении в пространстве оказывается существенной для исполнения различных глитчей / нарушений последовательности прохождения."
				},
				{
					"name": "TAS / Tool Assisted Speedrun — машина «ТАС»",
					"link": "https://youtu.be/UsILuQV1cRk?t=2m58s",
					"description": "Машина которая покажет вам идеальный забег. Спидран, созданный с помощью машины, позволяет увидеть, как будет выглядеть идеальное и в огромном числе случаев невозможное для исполнения человеком прохождение."
				},
				{
					"name": "warp — телепорт",
					"description": "Секретный прием халявного пропуска некоторых уровней или даже целых миров, специально добавленный в игру. Обычно можно найти в старых играх."
				},
				{
					"name": "WR / world record — мировой рекорд",
					"description": "ВР."
				},
				{
					"name": "zip - проскок / скачок",
					"description": "Используется в 2Д играх, быстрое проникновение в стены и прохождение через них. В настоящий момент все чаще находит применение в 3Д играх (Принц персии, Амнезия, Фоллаут 3)."
				}
			]
		},
		{
			"name": "Понятия марафонов",
			"words": [
				{
					"name": "GDQ (Games Done Quick)",
					"description": "Благотворительный игровой марафон, который проходит 2 раза в году: летом и зимой. SGDQ (Summer GDQ) и AGDQ (Awesome GDQ). Все собранные пожертвованиями деньги идут в определённую благотворительную организацию."
				},
				{
					"name": "roll сall — перекличка",
					"description": "Происходит, когда сам игрок и люди, сидящие на диване позади игрока (как правило, как-то связаные с представляемой игрой, чаще всего другие известные ранеры) представляются, и становится понятно, зачем они вообще на экране."
				},
				{
					"name": "setup",
					"description": "Подготовка к спидрану, настройка игровой платформы и просто пауза между забегами во время марафона."
				},
				{
					"name": "shots fired (дословно — «выстрелы сделаны»)",
					"description": "Крылатое выражение. Ближайшие аналоги: «перчатка брошена», «камень в твой огород». Употребляется, когда кто-то высказал довольно резкое мнение относительно чего-либо ещё (иногда завуалированно, и не обязательно строго отрицательное). «Я играю в эту игру на PC, потому что Sony слишком убого её оптимизировали на своей консоли» — «Shots fired!»"
				},
				{
					"name": "donation incentives — «цель для пожертвований»",
					"description": "Дополнительная цель, ради которой можно сделать пожертвование во время марафона. Стимул отправить деньги не только в пользу PCF/MSF, но и с целью повлиять на ход марафона или ради возможности получить приз. Есть несколько разновидностей: 1. Bid war — Война ставок Обычно проходит за имя персонажа, название save файла, способ прохождения игры. Выигрывает тот вариант, в пользу которого прислали больше всего денег. Пример: выбор между героями для прохождения Castlevania 64: Carrie или Reinhardt. 2. Bonus incentive — деньги собираются для того, чтобы во время марафона произошло какое-то событие: появление игры/категории в расписании или чтобы игрок сделал что-то необычное — играл вслепую, одной рукой, исполнил особо сложный трюк во время прохождения, или спел песню. Чтобы это случилось, сумма пожертвованных на эту цель денег должна достигнуть определённой цифры. 3. Raffle — лотерея, розыгрыш призов. Чтобы получить возможность выиграть приз (чаще всего какой-то гаджет или сувенир, связанный с играми), нужно прислать пожертвование не меньше указанной суммы (и как правило во время игры или блока игр, к которым относится приз). Например, пожертвовать не меньше 10$ во время Disney Block, чтобы получить шанс выиграть плюшевую игрушку Pluto. Во всех трёх случаях деньги идут на благо организации, которую поддерживает марафон. Kill/Save the animals Классическая война ставок, проходящая на каждом GDQ марафоне. В конце прохождения Super Metroid есть побочное задание: спасти животных. Это персонажи похожие на страусов и обезьян, которые в начале игры обучали главную героиню Wall Jump и Shine Spark, так что в благодарность их можно было бы и спасти... Однако на то чтобы их спасти уходит почти полминуты (нужно отклониться от основного пути и взорвать стену), поэтому чтобы ускорить прохождение, можно их не спасать, а отправиться сразу к завершению игры. Таким образом, деньги можно прислать как в пользу выполнения выполнения задания (save the animals), так и в пользу ускорения прохождения (save the frames, kill the animals) Почти всегда побеждает Kill the animals. В 2015 на AGDQ вариант Save the animals победил, когда за 40 секунд до окончания войны ставок аноним прислал $10.000 с комментарием «Get rekted, save the animals.» и все 1560 фреймов умерли мучительной смертью в тот день... Если вы не видели этот 100% run by sweetnumb - посмотрите, там зачётные really bad puns от аудитории."
				},
				{
					"name": "PCF (Prevent Cancer Foundation)",
					"description": "Фонд, занимающийся профилактикой и предотвращением раковых заболеваний."
				},
				{
					"name": "MSF (Médecins sans frontères, aka Doctors without borders)",
					"description": "Врачи без границ. Благотворительные организации, для поддержки которых как правило и проходят GDQ марафоны со сбором пожертвований (PCF - AGDQ, MSF - SGDQ + ESA). "
				},
				{
					"name": "ESA (European Speedrun Assembley – Европейское собрание спидранеров)",
					"description": "Ещё один большой благотворительный марафон, устраиваемый европейским спидран-сообществом летом в отличное от SGDQ время. Одной из особенностей можно считать наличие не одного, а двух каналов на твиче (не всегда), чтобы покрыть большее число контента и позволить большему числу человек поучаствовать."
				},
				{
					"name": "marathon «luck» — Марафонная «удача»",
					"description": "Особо эпичные фейлы, которые во время повседневной практики обычно не случаются, например, не получаются легчайшие трюки, внезапно кончаются патроны и так далее. Обычно списывается на то, что во время марафона все обязано пойти «не так»."
				},
				{
					"name": "«This never happened before» — «Такого никогда не случалось»",
					"description": "крайне нетипичная ситуация, особый представитель того, что может пойти «не так». Прямое следствие marathon «luck». Обычно, интереса ради, заводят счетчик, подсчитывающий число подобных ситуаций на одном марафоне."
				},
				{
					"name": "SDA / Speed Demos Archive",
					"link": "http://www.speeddemosarchive.com",
					"description": "Люди, которые устраивают GDQ, однако сайт очень медленно обновляется, как следствие, не предоставляет актуальных спидранов, описания правил и т.д."
				},
				{
					"name": "TASVideos",
					"link": "http://www.tasvideos.org",
					"description": "Сайт с TAS'ами"
				}
			]
		},
		{
			"name": "Категории забегов",
			"words": [
				{
					"name": "100%",
					"description": "Категория прохождения, для успешного завершения которого должны быть собраны все 100% внутриигровых предметов и/или выполнены все достижения. В играх, где нет счётчика процентов/списка достижений сообщество раннеров само решает, какие части игры достаточно значимы, чтобы быть обязательными в прохождении на 100%. Не все игры могут быть сыграны в категории 100% (Например, любые рогалики)."
				},
				{
					"name": "Any% - Любой%",
					"description": "Категория рана, без каких бы то ни было требований. «И так сойдет». Стандартная категория для любой игры. Термин родом из олдскульного сообщества спидранов Метроида. В Метроиде есть счетчик процентов прохождения, и даже несмотря на то, чт в большинстве игр такого нет, выражение прижилось."
				},
				{
					"name": "Blind — Вслепую",
					"description": "Забег без какой либо подготовки или забег в первый раз. В некоторых ситуациях «blind» - буквально спидран без возможности видеть игру, хотя вообще это называют «blindfolded», но вопросы возникают время от времени."
				},
				{
					"name": "Low% - Малый%",
					"description": "Категория, которая предполагает прохождение игры с минимальным возможным процентом прохождения, либо минимальным количеством предметов для прохождения. Малый% может занимать значительно больше времени, чем Any%, в зависимости от игры. Довольно редкая категория, но зрелищная. Например, Legend of Zelda Swordless run – прохождение первой Зельды без меча «It's dangerous to go alone! Take this»."
				},
				{
					"name": "Single Segment — «За раз»",
					"description": "Не сохраняться не загружаться. Не обязательно ускоряет игру, так как иногда сохранения/загрузки (save warp) сохраняют уйму времени. Может рассматриваться как отдельная категория прохождения, в котором НИ РАЗУ не использовалась загрузка сохранений."
				}
			]
		}
	]
}